import * as z from "zod";
const loginSchema = z.object({
  username: z
    .string({
      required_error: "نام کابری الزامی می باشد",
      invalid_type_error: "نام کاربری باید متن باشد",
    })
    .min(3, "نام کاربری حداقل باید دارای ۳ کاراکتر باشد")
    .max(30, "نام کابری باید حداکثر دارای ۳۰ کاراکتر باشد")
    .regex(
      /^[a-zA-Z0-9_]+$/,
      "نام کاربری فقط میتواند شامل حروف و اعداد و ـ باشد",
    ),
  password: z
    .string({
      required_error: "گذرواژه الزامی می باشد",
      invalid_type_error: "گذرواژه باید متن باشد",
    })
    .min(8, "گذرواژه حداقل باید دارای ۳ کاراکتر باشد")
    .max(128, "گذرواژه باید حداکثر دارای ۱۲۸ کاراکتر باشد")
    .regex(/[a-z]/, "گذرواژه باید حداقل شامل حروف کوچک باشد")
    .regex(/[A-Z]/, "گذرواژه حداقل باید یک حرف بزرگ داشته باشد")
    .regex(/[0-9]/, "گذرواژه حداقل باید یک عدد داشته باشد")
    .regex(/[^A-Za-z0-9]/, "گذرواژه حداقل باید یک کاراکتر ویژه داشته باشد"),
});
export default loginSchema;
